Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC0TIME" offset="0x350" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC0TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC1TIME" offset="0x360" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC1TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC1TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC1TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC1TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC1TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC2TIME" offset="0x370" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC2TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC2TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC2TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC2TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC2TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC3TIME" offset="0x380" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC3TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC3TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC3TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC3TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC3TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC4TIME" offset="0x390" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC4TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC4TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC4TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC4TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC4TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC5TIME" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC5TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC5TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC5TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC5TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC5TIME__ADCEIS" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 1" name="ADCEIEN1" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000001" name="EIEN0" values="ADCEIEN1__EIEN0" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000002" name="EIEN1" values="ADCEIEN1__EIEN1" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000004" name="EIEN2" values="ADCEIEN1__EIEN2" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000008" name="EIEN3" values="ADCEIEN1__EIEN3" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000010" name="EIEN4" values="ADCEIEN1__EIEN4" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000020" name="EIEN5" values="ADCEIEN1__EIEN5" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000040" name="EIEN6" values="ADCEIEN1__EIEN6" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000080" name="EIEN7" values="ADCEIEN1__EIEN7" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000100" name="EIEN8" values="ADCEIEN1__EIEN8" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000200" name="EIEN9" values="ADCEIEN1__EIEN9" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000400" name="EIEN10" values="ADCEIEN1__EIEN10" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000800" name="EIEN11" values="ADCEIEN1__EIEN11" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00001000" name="EIEN12" values="ADCEIEN1__EIEN12" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00002000" name="EIEN13" values="ADCEIEN1__EIEN13" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00004000" name="EIEN14" values="ADCEIEN1__EIEN14" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00008000" name="EIEN15" values="ADCEIEN1__EIEN15" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00010000" name="EIEN16" values="ADCEIEN1__EIEN16" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00020000" name="EIEN17" values="ADCEIEN1__EIEN17" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00040000" name="EIEN18" values="ADCEIEN1__EIEN18" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00080000" name="EIEN19" values="ADCEIEN1__EIEN19" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00100000" name="EIEN20" values="ADCEIEN1__EIEN20" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00200000" name="EIEN21" values="ADCEIEN1__EIEN21" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00400000" name="EIEN22" values="ADCEIEN1__EIEN22" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00800000" name="EIEN23" values="ADCEIEN1__EIEN23" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x01000000" name="EIEN24" values="ADCEIEN1__EIEN24" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x02000000" name="EIEN25" values="ADCEIEN1__EIEN25" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x04000000" name="EIEN26" values="ADCEIEN1__EIEN26" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x08000000" name="EIEN27" values="ADCEIEN1__EIEN27" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 2" name="ADCEIEN2" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000002" name="EIEN33" values="ADCEIEN2__EIEN33" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000004" name="EIEN34" values="ADCEIEN2__EIEN34" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000008" name="EIEN35" values="ADCEIEN2__EIEN35" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000010" name="EIEN36" values="ADCEIEN2__EIEN36" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000020" name="EIEN37" values="ADCEIEN2__EIEN37" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000040" name="EIEN38" values="ADCEIEN2__EIEN38" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000080" name="EIEN39" values="ADCEIEN2__EIEN39" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000100" name="EIEN40" values="ADCEIEN2__EIEN40" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000200" name="EIEN41" values="ADCEIEN2__EIEN41" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00002000" name="EIEN45" values="ADCEIEN2__EIEN45" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00004000" name="EIEN46" values="ADCEIEN2__EIEN46" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00008000" name="EIEN47" values="ADCEIEN2__EIEN47" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00010000" name="EIEN48" values="ADCEIEN2__EIEN48" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00020000" name="EIEN49" values="ADCEIEN2__EIEN49" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00040000" name="EIEN50" values="ADCEIEN2__EIEN50" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00080000" name="EIEN51" values="ADCEIEN2__EIEN51" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00100000" name="EIEN52" values="ADCEIEN2__EIEN52" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00200000" name="EIEN53" values="ADCEIEN2__EIEN53" />
         </register>
         <register caption="ADC Early Interrupt Status Register 1" name="ADCEISTAT1" offset="0x3e0" rw="R" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000001" name="EIRDY0" values="ADCEISTAT1__EIRDY0" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000002" name="EIRDY1" values="ADCEISTAT1__EIRDY1" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000004" name="EIRDY2" values="ADCEISTAT1__EIRDY2" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000008" name="EIRDY3" values="ADCEISTAT1__EIRDY3" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000010" name="EIRDY4" values="ADCEISTAT1__EIRDY4" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000020" name="EIRDY5" values="ADCEISTAT1__EIRDY5" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000040" name="EIRDY6" values="ADCEISTAT1__EIRDY6" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000080" name="EIRDY7" values="ADCEISTAT1__EIRDY7" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000100" name="EIRDY8" values="ADCEISTAT1__EIRDY8" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000200" name="EIRDY9" values="ADCEISTAT1__EIRDY9" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000400" name="EIRDY10" values="ADCEISTAT1__EIRDY10" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000800" name="EIRDY11" values="ADCEISTAT1__EIRDY11" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00001000" name="EIRDY12" values="ADCEISTAT1__EIRDY12" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00002000" name="EIRDY13" values="ADCEISTAT1__EIRDY13" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00004000" name="EIRDY14" values="ADCEISTAT1__EIRDY14" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00008000" name="EIRDY15" values="ADCEISTAT1__EIRDY15" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00010000" name="EIRDY16" values="ADCEISTAT1__EIRDY16" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00020000" name="EIRDY17" values="ADCEISTAT1__EIRDY17" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00040000" name="EIRDY18" values="ADCEISTAT1__EIRDY18" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00080000" name="EIRDY19" values="ADCEISTAT1__EIRDY19" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00100000" name="EIRDY20" values="ADCEISTAT1__EIRDY20" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00200000" name="EIRDY21" values="ADCEISTAT1__EIRDY21" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00400000" name="EIRDY22" values="ADCEISTAT1__EIRDY22" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00800000" name="EIRDY23" values="ADCEISTAT1__EIRDY23" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x01000000" name="EIRDY24" values="ADCEISTAT1__EIRDY24" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x02000000" name="EIRDY25" values="ADCEISTAT1__EIRDY25" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x04000000" name="EIRDY26" values="ADCEISTAT1__EIRDY26" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x08000000" name="EIRDY27" values="ADCEISTAT1__EIRDY27" />
         </register>
