Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
      <value-group caption="Reference Clock Output Enable bit" name="REFO1CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO1CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO1CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO1CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff"/>
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3"/>
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO2CON__ROSEL">
         <value caption="Reference Clock Input REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL Output SPLL" name="SPLL" value="0x7" />
         <value caption="Secondary Oscillator SOSC" name="Sosc" value="0x5" />
         <value caption="Low Power Oscillator LPRC" name="LPRC" value="0x4" />
         <value caption="Internal Fast Oscillator FRC" name="FRC" value="0x3" />
         <value caption="Primary Oscillator POSC" name="Posc" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="System clock SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO2CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO2CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO2CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO2CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO2CON__SIDL">
         <value caption="Discontinue module operation when the device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFO2CON__ON">
         <value caption="Reference Oscillator Module enabled" name="" value="0x1" />
         <value caption="Reference Oscillator Module disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO2CON__RODIV">
         <value caption="REFO clock is Base clock frequency divided by 65534" name="" value="0x7fff"/>
         <value caption="REFO clock is Base clock frequency divided by 6 (3*2)" name="" value="0x3"/>
         <value caption="REFO clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
         <value caption="REFO clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
         <value caption="REFO is the same frequency as Base Clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO3CON__ROSEL">
         <value caption="Reference Clock Input REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL Output SPLL" name="SPLL" value="0x7" />
         <value caption="Secondary Oscillator SOSC" name="Sosc" value="0x5" />
         <value caption="Low Power Oscillator LPRC" name="LPRC" value="0x4" />
         <value caption="Internal Fast Oscillator FRC" name="FRC" value="0x3" />
         <value caption="Primary Oscillator POSC" name="Posc" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="System clock SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO3CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO3CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO3CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO3CON__OE">
         <value caption="Reference clock is driven out on REFCLKOx pin" name="" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKOx pin" name="" value="0x0" />
      </value-group>
