Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
         <register caption="DMA Channel x Control Register" name="DCH0CON" offset="0x60" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH0CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH0CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH0CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH0CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH0CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH0CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH0CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH0CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH0CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH0CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH1CON" offset="0x120" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH1CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH1CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH1CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH1CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH1CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH1CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH1CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH1CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH1CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH1CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH2CON" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH2CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH2CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH2CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH2CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH2CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH2CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH2CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH2CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH2CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH2CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH3CON" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH3CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH3CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH3CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH3CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH3CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH3CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH3CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH3CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH3CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH3CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH4CON" offset="0x360" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH4CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH4CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH4CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH4CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH4CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH4CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH4CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH4CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH4CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH4CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
         <register caption="DMA Channel x Control Register" name="DCH5CON" offset="0x420" rw="RW" size="4">
            <bitfield caption="Channel Priority bits" mask="0x00000003" name="CHPRI" values="DCH5CON__CHPRI" />
            <bitfield caption="Channel Event Detected bit" mask="0x00000004" name="CHEDET" values="DCH5CON__CHEDET" />
            <bitfield caption="Channel Automatic Enable bit" mask="0x00000010" name="CHAEN" values="DCH5CON__CHAEN" />
            <bitfield caption="Channel Chain Enable bit" mask="0x00000020" name="CHCHN" values="DCH5CON__CHCHN" />
            <bitfield caption="Channel Allow Events If Disabled bit" mask="0x00000040" name="CHAED" values="DCH5CON__CHAED" />
            <bitfield caption="Channel Enable bit" mask="0x00000080" name="CHEN" values="DCH5CON__CHEN" />
            <bitfield caption="Chain Channel Selection bit" mask="0x00000100" name="CHCHNS" values="DCH5CON__CHCHNS" />
            <bitfield caption="Pattern Length bit" mask="0x00000800" name="CHPATLEN" values="DCH5CON__CHPATLEN" />
            <bitfield caption="Enable Pattern Ignore Byte bit" mask="0x00002000" name="CHPIGNEN" values="DCH5CON__CHPIGNEN" />
            <bitfield caption="Channel Busy bit" mask="0x00008000" name="CHBUSY" values="DCH5CON__CHBUSY" />
            <bitfield mask="0xFF000000" name="CHPIGN" />
         </register>
