Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
         <register caption="" name="CNNEF" offset="0x5a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEF" />
            <bitfield mask="0x00000002" name="CNNEF" />
            <bitfield mask="0x00000004" name="CNNEF" />
            <bitfield mask="0x00000008" name="CNNEF" />
            <bitfield mask="0x00000010" name="CNNEF" />
            <bitfield mask="0x00000020" name="CNNEF" />
            <bitfield mask="0x00000040" name="CNNEF" />
            <bitfield mask="0x00000080" name="CNNEF" />
            <bitfield mask="0x00000100" name="CNNEF" />
            <bitfield mask="0x00000200" name="CNNEF" />
            <bitfield mask="0x00000400" name="CNNEF" />
            <bitfield mask="0x00000800" name="CNNEF" />
            <bitfield mask="0x00001000" name="CNNEF" />
            <bitfield mask="0x00002000" name="CNNEF" />
            <bitfield mask="0x00004000" name="CNNEF" />
            <bitfield mask="0x00008000" name="CNNEF" />
         </register>
         <register caption="" name="CNNEG" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEG" />
            <bitfield mask="0x00000002" name="CNNEG" />
            <bitfield mask="0x00000004" name="CNNEG" />
            <bitfield mask="0x00000008" name="CNNEG" />
            <bitfield mask="0x00000010" name="CNNEG" />
            <bitfield mask="0x00000020" name="CNNEG" />
            <bitfield mask="0x00000040" name="CNNEG" />
            <bitfield mask="0x00000080" name="CNNEG" />
            <bitfield mask="0x00000100" name="CNNEG" />
            <bitfield mask="0x00000200" name="CNNEG" />
            <bitfield mask="0x00000400" name="CNNEG" />
            <bitfield mask="0x00000800" name="CNNEG" />
            <bitfield mask="0x00001000" name="CNNEG" />
            <bitfield mask="0x00002000" name="CNNEG" />
            <bitfield mask="0x00004000" name="CNNEG" />
            <bitfield mask="0x00008000" name="CNNEG" />
         </register>
         <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFA" />
            <bitfield mask="0x00000002" name="CNFA" />
            <bitfield mask="0x00000004" name="CNFA" />
            <bitfield mask="0x00000008" name="CNFA" />
            <bitfield mask="0x00000010" name="CNFA" />
            <bitfield mask="0x00000020" name="CNFA" />
            <bitfield mask="0x00000040" name="CNFA" />
            <bitfield mask="0x00000080" name="CNFA" />
            <bitfield mask="0x00000100" name="CNFA" />
            <bitfield mask="0x00000200" name="CNFA" />
            <bitfield mask="0x00000400" name="CNFA" />
            <bitfield mask="0x00000800" name="CNFA" />
            <bitfield mask="0x00001000" name="CNFA" />
            <bitfield mask="0x00002000" name="CNFA" />
            <bitfield mask="0x00004000" name="CNFA" />
            <bitfield mask="0x00008000" name="CNFA" />
         </register>
         <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFB" />
            <bitfield mask="0x00000002" name="CNFB" />
            <bitfield mask="0x00000004" name="CNFB" />
            <bitfield mask="0x00000008" name="CNFB" />
            <bitfield mask="0x00000010" name="CNFB" />
            <bitfield mask="0x00000020" name="CNFB" />
            <bitfield mask="0x00000040" name="CNFB" />
            <bitfield mask="0x00000080" name="CNFB" />
            <bitfield mask="0x00000100" name="CNFB" />
            <bitfield mask="0x00000200" name="CNFB" />
            <bitfield mask="0x00000400" name="CNFB" />
            <bitfield mask="0x00000800" name="CNFB" />
            <bitfield mask="0x00001000" name="CNFB" />
            <bitfield mask="0x00002000" name="CNFB" />
            <bitfield mask="0x00004000" name="CNFB" />
            <bitfield mask="0x00008000" name="CNFB" />
         </register>
         <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFC" />
            <bitfield mask="0x00000002" name="CNFC" />
            <bitfield mask="0x00000004" name="CNFC" />
            <bitfield mask="0x00000008" name="CNFC" />
            <bitfield mask="0x00000010" name="CNFC" />
            <bitfield mask="0x00000020" name="CNFC" />
            <bitfield mask="0x00000040" name="CNFC" />
            <bitfield mask="0x00000080" name="CNFC" />
            <bitfield mask="0x00000100" name="CNFC" />
            <bitfield mask="0x00000200" name="CNFC" />
            <bitfield mask="0x00000400" name="CNFC" />
            <bitfield mask="0x00000800" name="CNFC" />
            <bitfield mask="0x00001000" name="CNFC" />
            <bitfield mask="0x00002000" name="CNFC" />
            <bitfield mask="0x00004000" name="CNFC" />
            <bitfield mask="0x00008000" name="CNFC" />
         </register>
         <register caption="" name="CNFD" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFD" />
            <bitfield mask="0x00000002" name="CNFD" />
            <bitfield mask="0x00000004" name="CNFD" />
            <bitfield mask="0x00000008" name="CNFD" />
            <bitfield mask="0x00000010" name="CNFD" />
            <bitfield mask="0x00000020" name="CNFD" />
            <bitfield mask="0x00000040" name="CNFD" />
            <bitfield mask="0x00000080" name="CNFD" />
            <bitfield mask="0x00000100" name="CNFD" />
            <bitfield mask="0x00000200" name="CNFD" />
            <bitfield mask="0x00000400" name="CNFD" />
            <bitfield mask="0x00000800" name="CNFD" />
            <bitfield mask="0x00001000" name="CNFD" />
            <bitfield mask="0x00002000" name="CNFD" />
            <bitfield mask="0x00004000" name="CNFD" />
            <bitfield mask="0x00008000" name="CNFD" />
         </register>
         <register caption="" name="CNFE" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFE" />
            <bitfield mask="0x00000002" name="CNFE" />
            <bitfield mask="0x00000004" name="CNFE" />
            <bitfield mask="0x00000008" name="CNFE" />
            <bitfield mask="0x00000010" name="CNFE" />
            <bitfield mask="0x00000020" name="CNFE" />
            <bitfield mask="0x00000040" name="CNFE" />
            <bitfield mask="0x00000080" name="CNFE" />
            <bitfield mask="0x00000100" name="CNFE" />
            <bitfield mask="0x00000200" name="CNFE" />
            <bitfield mask="0x00000400" name="CNFE" />
            <bitfield mask="0x00000800" name="CNFE" />
            <bitfield mask="0x00001000" name="CNFE" />
            <bitfield mask="0x00002000" name="CNFE" />
            <bitfield mask="0x00004000" name="CNFE" />
            <bitfield mask="0x00008000" name="CNFE" />
         </register>
         <register caption="" name="CNFF" offset="0x5b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFF" />
            <bitfield mask="0x00000002" name="CNFF" />
            <bitfield mask="0x00000004" name="CNFF" />
            <bitfield mask="0x00000008" name="CNFF" />
            <bitfield mask="0x00000010" name="CNFF" />
            <bitfield mask="0x00000020" name="CNFF" />
            <bitfield mask="0x00000040" name="CNFF" />
            <bitfield mask="0x00000080" name="CNFF" />
            <bitfield mask="0x00000100" name="CNFF" />
            <bitfield mask="0x00000200" name="CNFF" />
            <bitfield mask="0x00000400" name="CNFF" />
            <bitfield mask="0x00000800" name="CNFF" />
            <bitfield mask="0x00001000" name="CNFF" />
            <bitfield mask="0x00002000" name="CNFF" />
            <bitfield mask="0x00004000" name="CNFF" />
            <bitfield mask="0x00008000" name="CNFF" />
         </register>
         <register caption="" name="CNFG" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFG" />
            <bitfield mask="0x00000002" name="CNFG" />
            <bitfield mask="0x00000004" name="CNFG" />
            <bitfield mask="0x00000008" name="CNFG" />
            <bitfield mask="0x00000010" name="CNFG" />
            <bitfield mask="0x00000020" name="CNFG" />
            <bitfield mask="0x00000040" name="CNFG" />
            <bitfield mask="0x00000080" name="CNFG" />
            <bitfield mask="0x00000100" name="CNFG" />
            <bitfield mask="0x00000200" name="CNFG" />
            <bitfield mask="0x00000400" name="CNFG" />
            <bitfield mask="0x00000800" name="CNFG" />
            <bitfield mask="0x00001000" name="CNFG" />
            <bitfield mask="0x00002000" name="CNFG" />
            <bitfield mask="0x00004000" name="CNFG" />
            <bitfield mask="0x00008000" name="CNFG" />
         </register>
         <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0A" />
            <bitfield mask="0x00000002" name="SRCON0A" />
            <bitfield mask="0x00000004" name="SRCON0A" />
            <bitfield mask="0x00000008" name="SRCON0A" />
            <bitfield mask="0x00000010" name="SRCON0A" />
            <bitfield mask="0x00000020" name="SRCON0A" />
            <bitfield mask="0x00000040" name="SRCON0A" />
            <bitfield mask="0x00000080" name="SRCON0A" />
            <bitfield mask="0x00000100" name="SRCON0A" />
            <bitfield mask="0x00000200" name="SRCON0A" />
            <bitfield mask="0x00000400" name="SRCON0A" />
            <bitfield mask="0x00000800" name="SRCON0A" />
            <bitfield mask="0x00001000" name="SRCON0A" />
            <bitfield mask="0x00002000" name="SRCON0A" />
            <bitfield mask="0x00004000" name="SRCON0A" />
            <bitfield mask="0x00008000" name="SRCON0A" />
         </register>
         <register caption="" name="SRCON0B" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0B" />
            <bitfield mask="0x00000002" name="SRCON0B" />
            <bitfield mask="0x00000004" name="SRCON0B" />
            <bitfield mask="0x00000008" name="SRCON0B" />
            <bitfield mask="0x00000010" name="SRCON0B" />
            <bitfield mask="0x00000020" name="SRCON0B" />
            <bitfield mask="0x00000040" name="SRCON0B" />
            <bitfield mask="0x00000080" name="SRCON0B" />
            <bitfield mask="0x00000100" name="SRCON0B" />
            <bitfield mask="0x00000200" name="SRCON0B" />
            <bitfield mask="0x00000400" name="SRCON0B" />
            <bitfield mask="0x00000800" name="SRCON0B" />
            <bitfield mask="0x00001000" name="SRCON0B" />
            <bitfield mask="0x00002000" name="SRCON0B" />
            <bitfield mask="0x00004000" name="SRCON0B" />
            <bitfield mask="0x00008000" name="SRCON0B" />
         </register>
         <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0C" />
            <bitfield mask="0x00000002" name="SRCON0C" />
            <bitfield mask="0x00000004" name="SRCON0C" />
            <bitfield mask="0x00000008" name="SRCON0C" />
            <bitfield mask="0x00000010" name="SRCON0C" />
            <bitfield mask="0x00000020" name="SRCON0C" />
            <bitfield mask="0x00000040" name="SRCON0C" />
            <bitfield mask="0x00000080" name="SRCON0C" />
            <bitfield mask="0x00000100" name="SRCON0C" />
            <bitfield mask="0x00000200" name="SRCON0C" />
            <bitfield mask="0x00000400" name="SRCON0C" />
            <bitfield mask="0x00000800" name="SRCON0C" />
            <bitfield mask="0x00001000" name="SRCON0C" />
            <bitfield mask="0x00002000" name="SRCON0C" />
            <bitfield mask="0x00004000" name="SRCON0C" />
            <bitfield mask="0x00008000" name="SRCON0C" />
         </register>
         <register caption="" name="SRCON0D" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0D" />
            <bitfield mask="0x00000002" name="SRCON0D" />
            <bitfield mask="0x00000004" name="SRCON0D" />
            <bitfield mask="0x00000008" name="SRCON0D" />
            <bitfield mask="0x00000010" name="SRCON0D" />
            <bitfield mask="0x00000020" name="SRCON0D" />
            <bitfield mask="0x00000040" name="SRCON0D" />
            <bitfield mask="0x00000080" name="SRCON0D" />
            <bitfield mask="0x00000100" name="SRCON0D" />
            <bitfield mask="0x00000200" name="SRCON0D" />
            <bitfield mask="0x00000400" name="SRCON0D" />
            <bitfield mask="0x00000800" name="SRCON0D" />
            <bitfield mask="0x00001000" name="SRCON0D" />
            <bitfield mask="0x00002000" name="SRCON0D" />
            <bitfield mask="0x00004000" name="SRCON0D" />
            <bitfield mask="0x00008000" name="SRCON0D" />
         </register>
         <register caption="" name="SRCON0E" offset="0x4c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0E" />
            <bitfield mask="0x00000002" name="SRCON0E" />
            <bitfield mask="0x00000004" name="SRCON0E" />
            <bitfield mask="0x00000008" name="SRCON0E" />
            <bitfield mask="0x00000010" name="SRCON0E" />
            <bitfield mask="0x00000020" name="SRCON0E" />
            <bitfield mask="0x00000040" name="SRCON0E" />
            <bitfield mask="0x00000080" name="SRCON0E" />
            <bitfield mask="0x00000100" name="SRCON0E" />
            <bitfield mask="0x00000200" name="SRCON0E" />
            <bitfield mask="0x00000400" name="SRCON0E" />
            <bitfield mask="0x00000800" name="SRCON0E" />
            <bitfield mask="0x00001000" name="SRCON0E" />
            <bitfield mask="0x00002000" name="SRCON0E" />
            <bitfield mask="0x00004000" name="SRCON0E" />
            <bitfield mask="0x00008000" name="SRCON0E" />
         </register>
         <register caption="" name="SRCON0F" offset="0x5c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON0F" />
            <bitfield mask="0x00000002" name="SRCON0F" />
            <bitfield mask="0x00000004" name="SRCON0F" />
            <bitfield mask="0x00000008" name="SRCON0F" />
            <bitfield mask="0x00000010" name="SRCON0F" />
            <bitfield mask="0x00000020" name="SRCON0F" />
            <bitfield mask="0x00000040" name="SRCON0F" />
            <bitfield mask="0x00000080" name="SRCON0F" />
            <bitfield mask="0x00000100" name="SRCON0F" />
            <bitfield mask="0x00000200" name="SRCON0F" />
            <bitfield mask="0x00000400" name="SRCON0F" />
            <bitfield mask="0x00000800" name="SRCON0F" />
            <bitfield mask="0x00001000" name="SRCON0F" />
            <bitfield mask="0x00002000" name="SRCON0F" />
            <bitfield mask="0x00004000" name="SRCON0F" />
            <bitfield mask="0x00008000" name="SRCON0F" />
         </register>
         <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1A" />
            <bitfield mask="0x00000002" name="SRCON1A" />
            <bitfield mask="0x00000004" name="SRCON1A" />
            <bitfield mask="0x00000008" name="SRCON1A" />
            <bitfield mask="0x00000010" name="SRCON1A" />
            <bitfield mask="0x00000020" name="SRCON1A" />
            <bitfield mask="0x00000040" name="SRCON1A" />
            <bitfield mask="0x00000080" name="SRCON1A" />
            <bitfield mask="0x00000100" name="SRCON1A" />
            <bitfield mask="0x00000200" name="SRCON1A" />
            <bitfield mask="0x00000400" name="SRCON1A" />
            <bitfield mask="0x00000800" name="SRCON1A" />
            <bitfield mask="0x00001000" name="SRCON1A" />
            <bitfield mask="0x00002000" name="SRCON1A" />
            <bitfield mask="0x00004000" name="SRCON1A" />
            <bitfield mask="0x00008000" name="SRCON1A" />
         </register>
