Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="Disable HLVD Output bit" mask="0x00000080" name="DISOUT" values="HLVDCON__DISOUT" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLEVT" values="HLVDCON__HLEVT" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="1.2V (Selects external LVDIN pin)" name="" value="0xf" />
         <value caption="2.4V" name="" value="0xa" />
         <value caption="2.5V" name="" value="0x9" />
         <value caption="2.69V" name="" value="0x8" />
         <value caption="2.791V" name="" value="0x7" />
         <value caption="3.0V" name="" value="0x6" />
         <value caption="3.288V" name="" value="0x5" />
         <value caption="3.529V" name="" value="0x4" />
      </value-group>
      <value-group caption="Disable HLVD Output bit" name="HLVDCON__DISOUT">
         <value caption="Enable output of HLVD Comparator. Once set, can only be cleared by setting the ON bit to 0." name="" value="0x1" />
         <value caption="Disable output of HLVD Comparator (default Reset value)." name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLEVT">
         <value caption="Indicates HLVD Event is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x1" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01441" name="I2C" version="">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C1CON__DHEN" />
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C1CON__AHEN" />
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C1CON__SBCDE" />
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C1CON__SDAHT" />
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C1CON__BOEN" />
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C1CON__SCIE" />
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C1CON__PCIE" />
         </register>
         <register caption="I2C Control Register" name="I2C2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C2CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C2CON__PEN" />
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit" mask="0x00000040" name="STREN" values="I2C2CON__STREN" />
            <bitfield caption="General Call Enable bit" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT" />
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON" />
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C2CON__DHEN" />
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C2CON__AHEN" />
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C2CON__SBCDE" />
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C2CON__SDAHT" />
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C2CON__BOEN" />
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C2CON__SCIE" />
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C2CON__PCIE" />
         </register>
