Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
         <register caption="Interrupt Priority Control Register" name="IPC39" offset="0x3b0" size="4">
            <bitfield mask="0x00000003" name="AD1D50IS" />
            <bitfield mask="0x0000001C" name="AD1D50IP" />
            <bitfield mask="0x00000300" name="AD1D51IS" />
            <bitfield mask="0x00001C00" name="AD1D51IP" />
            <bitfield mask="0x00030000" name="AD1D52IS" />
            <bitfield mask="0x001C0000" name="AD1D52IP" />
            <bitfield mask="0x03000000" name="AD1D53IS" />
            <bitfield mask="0x1C000000" name="AD1D53IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC40" offset="0x3c0" size="4">
            <bitfield mask="0x00000003" name="CMP3IS" />
            <bitfield mask="0x0000001C" name="CMP3IP" />
            <bitfield mask="0x00000300" name="CMP4IS" />
            <bitfield mask="0x00001C00" name="CMP4IP" />
            <bitfield mask="0x00030000" name="CMP5IS" />
            <bitfield mask="0x001C0000" name="CMP5IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC41" offset="0x3d0" size="4">
            <bitfield mask="0x03000000" name="CAN1IS" />
            <bitfield mask="0x1C000000" name="CAN1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC45" offset="0x410" size="4">
            <bitfield mask="0x00030000" name="DMA4IS" />
            <bitfield mask="0x001C0000" name="DMA4IP" />
            <bitfield mask="0x03000000" name="DMA5IS" />
            <bitfield mask="0x1C000000" name="DMA5IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC46" offset="0x420" size="4">
            <bitfield mask="0x00000003" name="DMA6IS" />
            <bitfield mask="0x0000001C" name="DMA6IP" />
            <bitfield mask="0x00000300" name="DMA7IS" />
            <bitfield mask="0x00001C00" name="DMA7IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC57" offset="0x4d0" size="4">
            <bitfield mask="0x00030000" name="SBIS" />
            <bitfield mask="0x001C0000" name="SBIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC59" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00030000" name="PWM7IS" />
            <bitfield mask="0x001C0000" name="PWM7IP" />
            <bitfield mask="0x03000000" name="PWM8IS" />
            <bitfield mask="0x1C000000" name="PWM8IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC60" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWM9IS" />
            <bitfield mask="0x0000001C" name="PWM9IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC61" offset="0x510" size="4">
            <bitfield mask="0x00000300" name="AD1DC3IS" />
            <bitfield mask="0x00001C00" name="AD1DC3IP" />
            <bitfield mask="0x00030000" name="AD1DC4IS" />
            <bitfield mask="0x001C0000" name="AD1DC4IP" />
            <bitfield mask="0x03000000" name="PCACHEIS" />
            <bitfield mask="0x1C000000" name="PCACHEIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC62" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x00000300" name="CLC1IS" />
            <bitfield mask="0x00001C00" name="CLC1IP" />
            <bitfield mask="0x00030000" name="CLC2IS" />
            <bitfield mask="0x001C0000" name="CLC2IP" />
            <bitfield mask="0x03000000" name="CLC3IS" />
            <bitfield mask="0x1C000000" name="CLC3IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC63" offset="0x530" size="4">
            <bitfield mask="0x00000003" name="CLC4IS" />
            <bitfield mask="0x0000001C" name="CLC4IP" />
            <bitfield mask="0x00030000" name="CPCIS" />
            <bitfield mask="0x001C0000" name="CPCIP" />
            <bitfield mask="0x03000000" name="CFDCIS" />
            <bitfield mask="0x1C000000" name="CFDCIP" />
         </register>
         <register caption="" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF002" offset="0x548" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF003" offset="0x54C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF004" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF005" offset="0x554" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF006" offset="0x558" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF007" offset="0x55C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF008" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF009" offset="0x564" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF010" offset="0x568" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF011" offset="0x56C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
