Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPG064.atdf
      <value-group caption="Output Compare Peripheral On bit" name="OC7CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC8CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high ; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC8CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC8CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC8CON__OC32">
         <value caption="OCxR and/or OCxRS are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC8CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC8CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC9CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7" />
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6" />
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5" />
         <value caption="Initialize OCx pin low: generate single output pulse on OCx pin" name="" value="0x4" />
         <value caption="Compare event toggles OCx pin" name="" value="0x3" />
         <value caption="Initialize OCx pin high ; compare event forces OCx pin low" name="" value="0x2" />
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1" />
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Timer Select bit" name="OC9CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1" />
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Fault Condition Status bit" name="OC9CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1" />
         <value caption="No PWM Fault condition has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC9CON__OC32">
         <value caption="OCxR and/or OCxRS are used for comparisions to the 32-bit timer source" name="" value="0x1" />
         <value caption="OCxR and OCxRS are used for comparisons to the 16-bit timer source" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC9CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC9CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1" />
         <value caption="Output Compare peripheral is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="03088" name="PCACHE" version="">
      <register-group name="PCACHE">
         <register caption="Cache Module Control Register" name="CHECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" mask="0x0000000F" name="PFMWS" values="CHECON__PFMWS" />
            <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="CHECON__PREFEN" />
            <bitfield caption="PFM Address Wait State Enable bit" mask="0x00000100" name="PFMAWSEN" values="CHECON__PFMAWSEN" />
            <bitfield caption="Cache Performance Counters Enable bit" mask="0x00001000" name="CHEPERFEN" values="CHECON__CHEPERFEN" />
            <bitfield caption="Instruction Auto-cache Coherency Control bit" mask="0x00010000" name="ICHECOH" values="CHECON__ICHECOH" />
            <bitfield caption="Data Auto-cache Coherency Control bit" mask="0x00020000" name="DCHECOH" values="CHECON__DCHECOH" />
            <bitfield caption="Peripheral Auto-cache Coherency Control bit" mask="0x00040000" name="PERCHECOH" values="CHECON__PERCHECOH" />
            <bitfield caption="Instruction Cache Invalidate bit" mask="0x00100000" name="ICHEINV" values="CHECON__ICHEINV" />
            <bitfield caption="Data Cache Invalidate bit" mask="0x00200000" name="DCHEINV" values="CHECON__DCHEINV" />
            <bitfield caption="Peripheral Cache Invalidate bit" mask="0x00400000" name="PERCHEINV" values="CHECON__PERCHEINV" />
            <bitfield caption="Instruction Cache Enable bit" mask="0x01000000" name="ICHEEN" values="CHECON__ICHEEN" />
            <bitfield caption="Data Cache Enable bit" mask="0x02000000" name="DCHEEN" values="CHECON__DCHEEN" />
            <bitfield caption="Peripheral Cache Enable bit" mask="0x04000000" name="PERCHEEN" values="CHECON__PERCHEEN" />
         </register>
         <register caption="" name="CHESTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="PFMSECCNT" />
            <bitfield mask="0x04000000" name="PFMSEC" />
            <bitfield mask="0x08000000" name="PFMDED" />
         </register>
         <register caption="CACHE Hit Status Register" name="CHEHIT" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEHIT" />
         </register>
